# Напишите функцию print_operation_table(operation, num_rows, num_columns), которая принимает в качестве аргумента функцию, вычисляющую элемент по номеру строки и столбца.
# Аргументы num_rows и num_columns указывают число строк и столбцов таблицы, которые должны быть распечатаны.
# Нумерация строк и столбцов идет с единицы (подумайте, почему не с нуля).
# Если строк меньше двух, выдайте текст
# ОШИБКА! Размерности таблицы должны быть больше 2!.
# Примечание: бинарной операцией называется любая операция, у которой ровно два аргумента, как, например, у операции умножения.
# Пример
# На входе:

# def print_operation_table(operation, num_rows, num_columns):
#     if num_rows <=2 or num_columns <=2:
#         print('ОШИБКА! Размерности таблицы должны быть больше 2!')
#         return    
#     for i in range(num_rows):
#         for j in range(num_columns):
#             print(f'{operation(i+1, j+1)}',end = ' ' )
#         print()

# print_operation_table(lambda x,y: x*y, 3,4)

# На выходе:
# 1 2 3
# 2 4 6
# 3 6 9





# Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. Поскольку разобраться в его кричалках не настолько просто, насколько легко он их придумывает, Вам стоит написать программу.
# Винни-Пух считает, что ритм есть, если число слогов (т.е. число гласных букв) в каждой фразе стихотворения одинаковое.
# Фраза может состоять из одного слова, если во фразе несколько слов, то они разделяются дефисами.
# Фразы отделяются друг от друга пробелами.
# Стихотворение Винни-Пух передаст вам автоматически в переменную stroka в виде строки. В ответе напишите Парам пам-пам, если с ритмом все в порядке и Пам парам, если с ритмом все не в порядке.
# Если фраза только одна, то ритм определить не получится и необходимо вывести: Количество фраз должно быть больше одной!.
# Пример
# На входе:

# stroka = 'пара-ра-рам пампампапа'
# stroka = stroka.split()    

# glasnie = ('у','е','ы','а','о','э','я','и','ю')

# def countGlasnih(word, coll):
#     counter = 0
#     for x in range(len(word)):
#         for j in range(len(coll)):
#             if word[x]==coll[j]:
#                 counter = counter +1
                
#     return counter

# list = []
# for i in range (len(stroka)):
#     list.append(countGlasnih(stroka[i],glasnie))
# list = set(list)
# def answer(set, proverka):
#     if len(proverka)==1:
#         print('Количество фраз должно быть больше одной!')
#         return
#     elif len(set) == 1:
#         print('Парам пам-пам')
#     else:
#         print('Пам парам')
# answer(list,stroka)
# На выходе:

# Парам пам-пам